#include "pause_menu_root.h"

#include "pause_menu_goals.h"
#include "comic_panels.h"
#include "common.h"
#include "entity_base.h"
#include "fe_health_widget.h"
#include "fetext.h"
#include "femanager.h"
#include "femenusystem.h"
#include "igofrontend.h"
#include "mstring.h"
#include "panelquad.h"
#include "pausemenusystem.h"
#include "panelfile.h"
#include "utility.h"
#include "trace.h"
#include "vtbl.h"
#include "wds.h"
#include "movie_manager.h"
#include "main.h"

#include "ngl/include/dx/ngl_dx_state.h"

#include "game.h"

#include "FileUSM.h"

#include "fe_menu_nav_bar.h"

#include "femultilinetext.h"
#include "mission_manager.h"

#include "variables.h"

#include "sound_instance_id.h"

#include "cursor.h"

#include "script_object.h"

#include "variables.h"

#include "wds.h"




#include "string_hash.h"


VALIDATE_SIZE(pause_menu_root, 0x100u);

VALIDATE_SIZE(pause_menu_root2, 0x104u);


pause_menu_root::pause_menu_root(FEMenuSystem *a2, int a3, int a4) : FEMenu(a2, 0, a3, a4, 8, 0) {
    this->field_AC = a2;

    this->field_A0 = nullptr;
    this->field_B0 = 0;
    this->field_B4 = 0;
    this->field_30 = 0;
    this->field_2C = 0;
    this->field_2D = 0;
}



void pause_menu_root::_Load()
{
    TRACE("pause_menu_root::Load");

    if constexpr (1)
    {
        auto *v2 = bit_cast<PauseMenuSystem *>(this->field_AC)->field_2C;

        this->field_3C[0] = v2->GetPQ("pm_splash_back_01a");
        this->field_3C[1] = v2->GetPQ("pm_splash_back_01b");

    color32 deselected_color{200, 200, 200, 255};
    FEText *text_box = this->field_AC->field_30->text_box;
    text_box->SetNoFlash(deselected_color);
    text_box->SetScale(1.0f, 1.0f);

    sub_582AD0();
    g_cursor()->sub_5A6790();
    g_cursor()->sub_5A67D0(305, 420, 385, 445);
  
  THISCALL(0x006302D0, this);
}

}



void pause_menu_root::update_switching_heroes() {
    int v2 = this->field_30;
    if (v2 == 4) {
        g_world_ptr->remove_player(g_world_ptr->num_players - 1);
    } else if (v2 == 2) {
        int v3;
        if (this->field_34) {
            g_world_ptr->add_player(mString{"venom"});

            v3 = 4;
        } else {
            g_world_ptr->add_player(mString{"ultimate_spiderman"});

            v3 = 0;
        }

        auto *v4 = g_femanager.IGO->hero_health;
        if (v4->field_0[v3] != nullptr)
        {
            v4->field_30 = g_world_ptr->get_hero_ptr(0)->my_handle.field_0;
            v4->field_38 = v3;
            v4->UpdateMasking();
            v4->clear_bars();
        }

        v4->SetShown(this->field_38);
    }

    --this->field_30;
}


 void pause_menu_root::run_script(const char* func_name)
{
    if (!this->field_F9)
    {
        // "Yes" selected
        int selection = this->field_B0;

        if (selection == 9)
        {
            // Initiate hero switch
          //  this->field_F8 = is_spidey;

            string_hash toggle_hash;
            toggle_hash.initialize(0, func_name, 0);
			    auto* v1 = script::gsoi()->parent;
			int function = script::find_function(toggle_hash, v1, 0);
			script::new_thread(function, reinterpret_cast<script_instance*>(script::gsoi()));
    

            script::sub_5028B0(toggle_hash, script::gsoi());
            script::exec_thread(0);
			
			    auto* v5 = this->field_AC;
    if (v5->m_index >= 0) {
        v5->MakeActive(0);
        comic_panels::game_play_panel()->field_67 = v5->m_count;
    }
		Sleep(500);		
pause_menu_system_ptr->Deactivate();
static string_hash sfx_id_hash{"FE_PS_ACCEPT"};
[[maybe_unused]] sound_instance_id id = sub_60B960(sfx_id_hash, 1.0, 1.0);
}

        if (selection == 8)
        {
            // Initiate hero switch
          //  this->field_F8 = is_spidey;

            string_hash toggle_hash;
            toggle_hash.initialize(0, func_name, 0);
			    auto* v1 = script::gsoi()->parent;
			int function = script::find_function(toggle_hash, v1, 0);
			script::new_thread(function, reinterpret_cast<script_instance*>(script::gsoi()));
    

            script::sub_5028B0(toggle_hash, script::gsoi());
            script::exec_thread(0);
			
			    auto* v5 = this->field_AC;
    if (v5->m_index >= 0) {
        v5->MakeActive(0);
        comic_panels::game_play_panel()->field_67 = v5->m_count;
    }
			
pause_menu_system_ptr->Deactivate();
	Sleep(500);

        }
		
		

static string_hash sfx_id_hash{"FE_PS_ACCEPT"};
[[maybe_unused]] sound_instance_id id = sub_60B960(sfx_id_hash, 1.0, 1.0);
}

        }
		

     

// Static string hashes for sounds (lazy initialized)
static inline string_hash s_fe_ps_accept_0;  // 0x20 flag
static inline string_hash s_fe_ps_accept_1;  // 0x40 flag
static inline string_hash s_fe_ps_accept_2;  // 0x80 flag
static inline string_hash s_fe_ps_accept_3;  // 0x100 flag
static inline string_hash s_fe_ps_accept_4;  // 0x200 flag
static inline string_hash s_fe_ps_accept_5;  // 0x400 flag
static inline string_hash s_fe_ps_accept_6;  // 0x800 flag
static inline string_hash s_fe_ps_accept_7;  // 0x1000 flag
static inline string_hash s_fe_ps_accept_8;  // 0x2000 flag
static inline string_hash s_fe_ps_accept_9;  // 0x10 flag
static inline string_hash s_fe_ps_accept_10; // 0x8 flag
static inline string_hash s_fe_wb_accept;    // 0x4 flag
static inline string_hash s_toggle_hero;     // 0x2 flag
static inline string_hash s_progression_mis; // 0x1 flag

static inline int s_initialized_flags = 0;

struct menu_widget{
  int  field_32;
menu_widget * field_36;  
  int  field_20;
  int  field_24;
   bool field_28;
   int field_40;
  int  field_44;
   int field_45; 
int count;  


    };

// Helper to initialize sound hash if needed
static string_hash get_sound_hash(int flag, string_hash &hash, const char *name) {
    if ((s_initialized_flags & flag) == 0) {
        s_initialized_flags |= flag;
        hash = string_hash{name};
    }
    return hash;
}

// Helper to set menu state
void pause_menu_root::set_menu_state(int state) {
    auto *menu_data = this->field_AC->field_4[1];
    menu_data[18];  // offset 72 / sizeof(int)
}

// Helper to activate menu and update comic panel
void pause_menu_root::activate_menu(int mode) {
    auto *menu_system = this->field_AC;
    menu_system->MakeActive(mode);
    
    if (!menu_system->field_10) {
